Revit 2026 API

# ElectricalSettingRemoveWireType Method

---

Remove wire type definition from project.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void RemoveWireType(
	WireType wireType
)
```
```vb
Public Sub RemoveWireType (
	wireType As WireType
)
```
```cpp
public:
void RemoveWireType(
	WireType^ wireType
)
```
```fsharp
member RemoveWireType :
        wireType : WireType -> unit
```

#### Parameters

wireType WireType

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Wire type can be removed only if it is not used, otherwise an exception will be thrown. |

#### Reference

ElectricalSetting Class

Autodesk.Revit.DB.Electrical Namespace